<h1>Classification of Degrees awarded (2016/17)</h1>
<p>In this Notebook you will show the degree classifications awareded from academic year 2016/17 as a pie plot</p>
<p>You will require the files produced when you completed the previous exercise</p>

<h2>Import PANDAs and Matplotlib.pylot</h2>
<p>You will be using the pandas dataframe to store the data and Matplotlib pyplot to plot the data.  Import the necessary libraries</h2>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

<h2>Read the data into a PANDAs DataFrame</h2>
<p>Read the 'df.csv' in to a data frame called df, use the head method to output the first 20 rows of the datafile so that the structure of the dataframe can be explored.</p>

In [3]:
df = pd.read_csv('df.csv')
df.head(20)

,Unnamed: 0,Academic Year,Classification of First Degree,Number,Percentage
0,17,2013/14,First,79410,20
1,18,2013/14,Lower second,95965,24
2,19,2013/14,Third/Pass,21905,6
3,21,2013/14,Upper second,198320,50
4,292,2014/15,First,81640,22
5,293,2014/15,Lower second,85250,23
6,294,2014/15,Third/Pass,20340,5
7,296,2014/15,Upper second,183680,50
8,567,2015/16,First,88890,24
9,568,2015/16,Lower second,81595,22
10,569,2015/16,Third/Pass,19280,5
11,571,2015/16,Upper second,186565,50
12,842,2016/17,First,100945,26
13,843,2016/17,Lower second,79515,20
14,844,2016/17,Third/Pass,19025,5
15,846,2016/17,Upper second,192395,49
16,1122,2017/18,First,110475,28
17,1123,2017/18,Lower second,76210,19
18,1124,2017/18,Third/Pass,17830,4
19,1126,2017/18,Upper second,192425,48

<h2>Creating a new DataFrame</h2>
<p>Create a new dataframe named df_16_17 that contains only the rows where the 'Academic Year' column has the value '2016/17', then output the dataframe to make sure you have the correct four rows.</p>

In [5]:
mask = df['Academic Year'] == '2016/17'
df_16_17 = df[mask]
df_16_17.head(20)

,Unnamed: 0,Academic Year,Classification of First Degree,Number,Percentage
12,842,2016/17,First,100945,26
13,843,2016/17,Lower second,79515,20
14,844,2016/17,Third/Pass,19025,5
15,846,2016/17,Upper second,192395,49

<h2>Setting the Index</h2>
<p>Set Academic Year as the row index and remove any unnamed columns.  Then output the dataframe to make sure it is as expected</p>

In [6]:
df_16_17.drop(columns=['Unnamed: 0'], inplace = True)
df_16_17.head()

/tmp/ipykernel_24721/1910749940.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_16_17.drop(columns=['Unnamed: 0'], inplace = True)

   Academic Year Classification of First Degree  Number  Percentage
12       2016/17                          First  100945          26
13       2016/17                   Lower second   79515          20
14       2016/17                     Third/Pass   19025           5
15       2016/17                   Upper second  192395          49

<h2>Define the Size of the Figure</h2>
<p>We are now ready to plot.  Figures consist of one or more plots, set the size of the figure to 10 inches by 5 inches. Give your figure a name called '16_17' and assign this object to a variable named fig</p>

In [ ]:
fig = plt.figure(num = '16_17', figsize = (10,5))

<h2>Create a Plot</h2>
<p>Create a pie plot using using the data from the 'Percentage' column.</p>

<h2>The explode attribute</h2>
<p>Use the explode attribute for the plot so that the first class degrees is slightly seperated from the rest of the slices, then replot</p>

<h2>The Shadow attribute</h2>
<p>Use the shadow attribute for the plot so that there is a shadow effect, then replot</p>

<h2>The Start Angle attribute</h2>
<p>Use the start angle attribute so that the pie chart is rotated by 90 degrees, the slice that represents the first class degrees should be in the top left of the plot.  Replot to make sure it has worked correctly</p>

<h2>Adding Percentages</h2>
<p>Add percentages to the plot for each slice.  Replot to make sure it has worked correctly</p>

<h2>Adding Labels</h2>
<p>Add labels for each slice so that we know which classification is associated with each slice.  Replot to make sure it has worked correctly</p>

<h2>Add a Title to the Plot</h2>
<p>Add a title to the plot, 'Classification of Degrees Awarded in 2016/17'</p>

<h2>What the Plot tells you</h2>
<p>Based on your plot, complete the following statements</p>
<ul>
<li>In academic year 2016/17, 26% of degrees awarded were ________________.</li>
<li>In academic year 2016/17, 20% of degrees awarded were ________________.</li>
<li>In academic year 2016/17, just under half the degrees awarded were ________________.</li>
<li>In academic year 2016/17, 25% of degrees awarded were either ________________ or ________________.</li>
</ul>